In [1]:
#importando bibliotecas
import matplotlib.pyplot as plt 
import pandas as pd
import seaborn as sns

In [4]:
#carregando a base
df = pd.read_csv(r"C:\Users\jogmo\Downloads\train.csv",)

# Dicionário:

In [6]:
#renomeando as colunas de forma traduzida
df = df.rename(columns={ 
    'PassengerId': 'idpassageiro',
    'Survived': 'sobreviveu',
    'Pclass': 'classepassageiro',
    'Name': 'nome',
    'Sex': 'sexo',
    'Age': 'idade',
    'SibSp': 'irmaos_conjuges_abordo',
    'Parch': 'pais_filhos_abordo',
    'Ticket': 'bilhete',
    'Fare': 'tarifa',
    'Cabin': 'cabine',
    'Embarked': 'embarque'
})

In [9]:
#verificando a base inicialmente 
df[['idpassageiro', 'nome', 'sexo', 'idade']].head(10)

,idpassageiro,nome,sexo,idade
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
5,6,"Moran, Mr. James",male,NaN
6,7,"McCarthy, Mr. Timothy J",male,54.0
7,8,"Palsson, Master. Gosta Leonard",male,2.0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

In [12]:
#verificando se as variáveis são dos tipos exigidos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   idpassageiro            891 non-null    int64
 1   sobreviveu              891 non-null    int64
 2   classepassageiro        891 non-null    int64
 3   nome                    891 non-null    object
 4   sexo                    891 non-null    object
 5   idade                   714 non-null    float64
 6   irmaos_conjuges_abordo  891 non-null    int64
 7   pais_filhos_abordo      891 non-null    int64
 8   bilhete                 891 non-null    object
 9   tarifa                  891 non-null    float64
 10  cabine                  204 non-null    object
 11  embarque                889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
#gerando estatisticas básicas
df.describe()

,idpassageiro,sobreviveu,classepassageiro,idade,irmaos_conjuges_abordo,pais_filhos_abordo,tarifa
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200